bean.descriptors.uninitialized=O mapa de descritores de beans n\u00e3o p\u00f4de ser inicializado.
collection.cannot.be.instantiated=Uma cole\u00e7\u00e3o do tipo [%s] n\u00e3o pode ser instanciada com um construtor nulo.
column.count.mismatch=O n\u00famero de nomes de colunas deve ser o mesmo que o n\u00famero de nomes de cabe\u00e7alho.
column.name.bogus=Nomes de colunas n\u00e3o podem ser nulos, vazios ou brancos.
column.nonexistant=A coluna %s n\u00e3o existe no resultado!
conversion.impossible=Conversao de %1$s para %2$s falhou.
csvdate.not.date=Anota\u00e7\u00e3o @CsvDate usada em um campo n\u00e3o-data.
csvreader.null=Incapaz de instanciar IterableCSVToBeanBuilder porque n\u00e3o h\u00e1 CSVReader definido.
custom.converter.invalid=Ocorreu um problema ao instanciar o conversor personlizado %s.
define.separator=O caractere de separa\u00e7\u00e3o precisa ser definido.
error.introspecting.beans=Houve um erro ao manipular o bean a ser escrito.
error.introspecting.field=Um erro de introspec\u00e7\u00e3o foi lan\u00e7ado ao tentar manipular a propriedade %1$s do bean %2$s.
error.writing.beans=Ocorreu um erro irrecuper\u00e1vel ao escrever os beans.
field.not.multivaluedmap=
field.not.primitive=O campo deve ser primitivo, primitivo encapsulado, BigDecimal, BigInteger ou String.
header.data.mismatch=N\u00famero de campos de dados incompat\u00edvel com n\u00famero de cabe\u00e7alhos.
header.data.mismatch.with.line.number=Erro no registro n\u00famero %d: O n\u00famero de elementos de dados n\u00e3o \u00e9 o mesmo n\u00famero de elementos de cabe\u00e7alho.
header.error=Erro ao capturar cabe\u00e7alho CSV.
header.name.bogus=Cabe\u00e7alho n\u00e3o pode ser nulo, vazio ou espa\u00e7os em branco.
header.nonexistant=Coluna n\u00e3o encontrada para cabe\u00e7alho [%s].
header.required.field.absent=Cabe\u00e7alho n\u00e2o cont\u00e9m campos obrigat\u00f3rios [%s]. A lista de cabe\u00e7alhos encontrados \u00e9 [%s].
header.unread=A linha de cabe\u00e7alho ainda n\u00e3o foi lida.
invalid.collection.type=O tipo especificado para a cole\u00e7\u00e3o \u00e9 desconhecida ou n\u00e3o implementa java.util.Collection: %s
invalid.multivaluedmap.type=
invalid.range.definition=
invalid.regex=A express\u00e3o regular especificada \u00e9 inv\u00e1lida: %s
map.cannot.be.instantiated=
matching=
multiline.limit.broken=Encontrado um \u00fanico registro com mais linhas do que o limite superior especificado de %d.
multiple.required.field.empty=Os seguintes campos obrigat\u00f3rios n\u00e3o est\u00e3o presentes para um registro da entrada:
no.converter.specified=Um conversor \u00e9 necess\u00e1rio, mas nenhum foi especificado.
nullary.constructor.not.allowed=O construtor nulo pode n\u00e3o ser usado em %s.
parsing.error=Erro ao analisar linha: %1$d, valor: %2$s
read.only.iterator=Este \u00e9 um iterator somente leitura.
reader.null=O leitor deve ser sempre n\u00e3o nulo.
required.field.empty=O campo '%s' \u00e9 obrigat\u00f3rio mas nenhum valor foi fornecido.
special.characters.must.differ=O separador, delimitador de texto e caractere de escape precisam ser diferentes!
specify.strategy.reader=Tanto a estrat\u00e9gia de mapeameto como o CSVReader/Reader precisam ser definido.
strategy.type.missing=A estrat\u00e9gia de mapeamento ou o tipo do bean a ser populado deve ser especificado.
strategy.undefined=Incapaz de instanciar IterableCSVToBeanBuilder porque n\u00e3o h\u00e1 MappingStrategy definida.
type.before.header=Voc\u00ea deve invocar MappingStrategy.setType() antes de invocar MappingStrategy.generateHeader().
type.unset=O tipo n\u00e3o foi definido no MappingStrategy.
unassignable.collection.type=A implementa\u00e7\u00e3o de cole\u00e7\u00e3o definida (%s) n\u00e3o pode ser atribu\u00edda ao tipo de campo (%s).
unassignable.multivaluedmap.type=
unterminated.quote=Delimitador de fim de campo texto n\u00e3o encontrado ao final da linha CSV. Come\u00e7o do texto perdido: (%s).